bonechipCFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    patch0
    {
        type            patch;
        physicalType    patch;
        nFaces          19847;
        startFace       91433;
    }
    inlet
    {
        type            patch;
        nFaces          2744;
        startFace       111280;
    }
    outlet
    {
        type            patch;
        nFaces          3007;
        startFace       114024;
    }
)

// ************************************************************************* //
