bonechipCFD/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name inletFaces;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box (1 0 0) (4 15 2);
        }
    }

    {
        name inletFaces;
        type faceSet;
        action subset;
        source patchToFace;
        sourceInfo
        {
            name patch0;
        }
    }

    {
        name outletFaces;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box (20 0 0) (23 15 2);
        }
    }

    {
        name outletFaces;
        type faceSet;
        action subset;
        source patchToFace;
        sourceInfo
        {
            name patch0;
        }
    }
);
